/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: rkyslyy <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/01/10 16:42:37 by rkyslyy           #+#    #+#             */
/*   Updated: 2018/01/10 16:42:39 by rkyslyy          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <limits.h>
#include "./srcs/prlib.h"
#include <locale.h>

int		main()
{
	setlocale(LC_ALL, "");

	ft_printf("mine: |%-40S\n", L"машина");
	   printf("orig: |%-40S\n", L"машина");
	return (0);
}
